name: "shufflenet_v2_x0.5"
layer {
  name: "data"
  type: "AnnotatedData"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    scale: 0.00392
    mirror: true
    mean_value: 0
    mean_value: 0
    mean_value: 0
    resize_param {
      prob: 1.0
      resize_mode: WARP
      height: 320
      width: 320
      interp_mode: LINEAR
      interp_mode: AREA
      interp_mode: NEAREST
      interp_mode: CUBIC
      interp_mode: LANCZOS4
    }
    emit_constraint {
      emit_type: CENTER
    }
    distort_param {
      brightness_prob: 0.5
      brightness_delta: 32.0
      contrast_prob: 0.5
      contrast_lower: 0.5
      contrast_upper: 1.5
      hue_prob: 0.5
      hue_delta: 18.0
      saturation_prob: 0.5
      saturation_lower: 0.5
      saturation_upper: 1.5
      random_order_prob: 0.0
    }
    expand_param {
      prob: 0.5
      max_expand_ratio: 4.0
    }
  }
  data_param {
    source: "/home1/lluo/01data/VOC/VOC0712_lmdb/VOC0712_trainval_lmdb/"
    batch_size: 8
    backend: LMDB
  }
  annotated_data_param {
    batch_sampler {
      max_sample: 1
      max_trials: 1
    }
    batch_sampler {
      sampler {
        min_scale: 0.3
        max_scale: 1.0
        min_aspect_ratio: 0.5
        max_aspect_ratio: 2.0
      }
      sample_constraint {
        min_jaccard_overlap: 0.1
      }
      max_sample: 1
      max_trials: 50
    }
    batch_sampler {
      sampler {
        min_scale: 0.3
        max_scale: 1.0
        min_aspect_ratio: 0.5
        max_aspect_ratio: 2.0
      }
      sample_constraint {
        min_jaccard_overlap: 0.3
      }
      max_sample: 1
      max_trials: 50
    }
    batch_sampler {
      sampler {
        min_scale: 0.3
        max_scale: 1.0
        min_aspect_ratio: 0.5
        max_aspect_ratio: 2.0
      }
      sample_constraint {
        min_jaccard_overlap: 0.5
      }
      max_sample: 1
      max_trials: 50
    }
    batch_sampler {
      sampler {
        min_scale: 0.3
        max_scale: 1.0
        min_aspect_ratio: 0.5
        max_aspect_ratio: 2.0
      }
      sample_constraint {
        min_jaccard_overlap: 0.7
      }
      max_sample: 1
      max_trials: 50
    }
    batch_sampler {
      sampler {
        min_scale: 0.3
        max_scale: 1.0
        min_aspect_ratio: 0.5
        max_aspect_ratio: 2.0
      }
      sample_constraint {
        min_jaccard_overlap: 0.9
      }
      max_sample: 1
      max_trials: 50
    }
    batch_sampler {
      sampler {
        min_scale: 0.3
        max_scale: 1.0
        min_aspect_ratio: 0.5
        max_aspect_ratio: 2.0
      }
      sample_constraint {
        max_jaccard_overlap: 1.0
      }
      max_sample: 1
      max_trials: 50
    }
    label_map_file: "/home1/lluo/01data/VOC/VOC0712_lmdb/labelmap.prototxt"
  }
}
layer {
  name: "data/bn"
  type: "BatchNorm"
  bottom: "data"
  top: "data"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "data/bn/scale"
  type: "Scale"
  bottom: "data"
  top: "data"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage1/conv"
  type: "Convolution"
  bottom: "data"
  top: "stage1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 24
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 1
    stride: 2
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage1/conv/bn"
  type: "BatchNorm"
  bottom: "stage1/conv"
  top: "stage1/conv"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage1/conv/bn/scale"
  type: "Scale"
  bottom: "stage1/conv"
  top: "stage1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage1/conv/relu"
  type: "ReLU"
  bottom: "stage1/conv"
  top: "stage1/conv"
}
layer {
  name: "stage1/pool"
  type: "Pooling"
  bottom: "stage1/conv"
  top: "stage1/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 0
  }
}
layer {
  name: "stage_2_1/conv4"
  type: "Convolution"
  bottom: "stage1/pool"
  top: "stage_2_1/conv4"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 24
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 24
    stride: 2
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_2_1/conv4/bn"
  type: "BatchNorm"
  bottom: "stage_2_1/conv4"
  top: "stage_2_1/conv4"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_2_1/conv4/bn/scale"
  type: "Scale"
  bottom: "stage_2_1/conv4"
  top: "stage_2_1/conv4"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_2_1/conv5"
  type: "Convolution"
  bottom: "stage_2_1/conv4"
  top: "stage_2_1/conv5"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 24
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_2_1/conv5/bn"
  type: "BatchNorm"
  bottom: "stage_2_1/conv5"
  top: "stage_2_1/conv5"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_2_1/conv5/bn/scale"
  type: "Scale"
  bottom: "stage_2_1/conv5"
  top: "stage_2_1/conv5"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_2_1/conv5/relu"
  type: "ReLU"
  bottom: "stage_2_1/conv5"
  top: "stage_2_1/conv5"
}
layer {
  name: "stage_2_1/conv1"
  type: "Convolution"
  bottom: "stage1/pool"
  top: "stage_2_1/conv1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 24
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_2_1/conv1/bn"
  type: "BatchNorm"
  bottom: "stage_2_1/conv1"
  top: "stage_2_1/conv1"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_2_1/conv1/bn/scale"
  type: "Scale"
  bottom: "stage_2_1/conv1"
  top: "stage_2_1/conv1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_2_1/conv1/relu"
  type: "ReLU"
  bottom: "stage_2_1/conv1"
  top: "stage_2_1/conv1"
}
layer {
  name: "stage_2_1/conv2"
  type: "Convolution"
  bottom: "stage_2_1/conv1"
  top: "stage_2_1/conv2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 24
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 24
    stride: 2
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_2_1/conv2/bn"
  type: "BatchNorm"
  bottom: "stage_2_1/conv2"
  top: "stage_2_1/conv2"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_2_1/conv2/bn/scale"
  type: "Scale"
  bottom: "stage_2_1/conv2"
  top: "stage_2_1/conv2"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_2_1/conv3"
  type: "Convolution"
  bottom: "stage_2_1/conv2"
  top: "stage_2_1/conv3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 24
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_2_1/conv3/bn"
  type: "BatchNorm"
  bottom: "stage_2_1/conv3"
  top: "stage_2_1/conv3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_2_1/conv3/bn/scale"
  type: "Scale"
  bottom: "stage_2_1/conv3"
  top: "stage_2_1/conv3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_2_1/conv3/relu"
  type: "ReLU"
  bottom: "stage_2_1/conv3"
  top: "stage_2_1/conv3"
}
layer {
  name: "stage_2_1/concat"
  type: "Concat"
  bottom: "stage_2_1/conv5"
  bottom: "stage_2_1/conv3"
  top: "stage_2_1/concat"
  concat_param {
    axis: 1
  }
}

layer {
  name: "stage_2_2/conv1"
  type: "Convolution"
  bottom: "stage_2_1/concat"
  top: "stage_2_2/conv1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 24
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_2_2/conv1/bn"
  type: "BatchNorm"
  bottom: "stage_2_2/conv1"
  top: "stage_2_2/conv1"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_2_2/conv1/bn/scale"
  type: "Scale"
  bottom: "stage_2_2/conv1"
  top: "stage_2_2/conv1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_2_2/conv1/relu"
  type: "ReLU"
  bottom: "stage_2_2/conv1"
  top: "stage_2_2/conv1"
}
layer {
  name: "stage_2_2/conv2"
  type: "Convolution"
  bottom: "stage_2_2/conv1"
  top: "stage_2_2/conv2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 24
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 24
    stride: 1
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_2_2/conv2/bn"
  type: "BatchNorm"
  bottom: "stage_2_2/conv2"
  top: "stage_2_2/conv2"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_2_2/conv2/bn/scale"
  type: "Scale"
  bottom: "stage_2_2/conv2"
  top: "stage_2_2/conv2"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_2_2/conv3"
  type: "Convolution"
  bottom: "stage_2_2/conv2"
  top: "stage_2_2/conv3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 24
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_2_2/conv3/bn"
  type: "BatchNorm"
  bottom: "stage_2_2/conv3"
  top: "stage_2_2/conv3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_2_2/conv3/bn/scale"
  type: "Scale"
  bottom: "stage_2_2/conv3"
  top: "stage_2_2/conv3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_2_2/conv3/relu"
  type: "ReLU"
  bottom: "stage_2_2/conv3"
  top: "stage_2_2/conv3"
}
layer {
  name: "stage_2_2/concat"
  type: "Concat"
  bottom: "stage_2_1/concat"
  bottom: "stage_2_2/conv3"
  top: "stage_2_2/concat"
  concat_param {
    axis: 1
  }
}

layer {
  name: "stage_2_3/conv1"
  type: "Convolution"
  bottom: "stage_2_2/concat"
  top: "stage_2_3/conv1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 24
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_2_3/conv1/bn"
  type: "BatchNorm"
  bottom: "stage_2_3/conv1"
  top: "stage_2_3/conv1"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_2_3/conv1/bn/scale"
  type: "Scale"
  bottom: "stage_2_3/conv1"
  top: "stage_2_3/conv1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_2_3/conv1/relu"
  type: "ReLU"
  bottom: "stage_2_3/conv1"
  top: "stage_2_3/conv1"
}
layer {
  name: "stage_2_3/conv2"
  type: "Convolution"
  bottom: "stage_2_3/conv1"
  top: "stage_2_3/conv2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 24
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 24
    stride: 1
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_2_3/conv2/bn"
  type: "BatchNorm"
  bottom: "stage_2_3/conv2"
  top: "stage_2_3/conv2"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_2_3/conv2/bn/scale"
  type: "Scale"
  bottom: "stage_2_3/conv2"
  top: "stage_2_3/conv2"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_2_3/conv3"
  type: "Convolution"
  bottom: "stage_2_3/conv2"
  top: "stage_2_3/conv3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 24
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_2_3/conv3/bn"
  type: "BatchNorm"
  bottom: "stage_2_3/conv3"
  top: "stage_2_3/conv3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_2_3/conv3/bn/scale"
  type: "Scale"
  bottom: "stage_2_3/conv3"
  top: "stage_2_3/conv3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_2_3/conv3/relu"
  type: "ReLU"
  bottom: "stage_2_3/conv3"
  top: "stage_2_3/conv3"
}
layer {
  name: "stage_2_3/concat"
  type: "Concat"
  bottom: "stage_2_2/concat"
  bottom: "stage_2_3/conv3"
  top: "stage_2_3/concat"
  concat_param {
    axis: 1
  }
}

layer {
  name: "stage_2_4/conv1"
  type: "Convolution"
  bottom: "stage_2_3/concat"
  top: "stage_2_4/conv1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 24
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_2_4/conv1/bn"
  type: "BatchNorm"
  bottom: "stage_2_4/conv1"
  top: "stage_2_4/conv1"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_2_4/conv1/bn/scale"
  type: "Scale"
  bottom: "stage_2_4/conv1"
  top: "stage_2_4/conv1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_2_4/conv1/relu"
  type: "ReLU"
  bottom: "stage_2_4/conv1"
  top: "stage_2_4/conv1"
}
layer {
  name: "stage_2_4/conv2"
  type: "Convolution"
  bottom: "stage_2_4/conv1"
  top: "stage_2_4/conv2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 24
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 24
    stride: 1
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_2_4/conv2/bn"
  type: "BatchNorm"
  bottom: "stage_2_4/conv2"
  top: "stage_2_4/conv2"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_2_4/conv2/bn/scale"
  type: "Scale"
  bottom: "stage_2_4/conv2"
  top: "stage_2_4/conv2"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_2_4/conv3"
  type: "Convolution"
  bottom: "stage_2_4/conv2"
  top: "stage_2_4/conv3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 24
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_2_4/conv3/bn"
  type: "BatchNorm"
  bottom: "stage_2_4/conv3"
  top: "stage_2_4/conv3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_2_4/conv3/bn/scale"
  type: "Scale"
  bottom: "stage_2_4/conv3"
  top: "stage_2_4/conv3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_2_4/conv3/relu"
  type: "ReLU"
  bottom: "stage_2_4/conv3"
  top: "stage_2_4/conv3"
}
layer {
  name: "stage_2_4/concat"
  type: "Concat"
  bottom: "stage_2_3/concat"
  bottom: "stage_2_4/conv3"
  top: "stage_2_4/concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "stage_3_1/conv4"
  type: "Convolution"
  bottom: "stage_2_4/concat"
  top: "stage_3_1/conv4"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 8
    stride: 2
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_3_1/conv4/bn"
  type: "BatchNorm"
  bottom: "stage_3_1/conv4"
  top: "stage_3_1/conv4"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_3_1/conv4/bn/scale"
  type: "Scale"
  bottom: "stage_3_1/conv4"
  top: "stage_3_1/conv4"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_3_1/conv5"
  type: "Convolution"
  bottom: "stage_3_1/conv4"
  top: "stage_3_1/conv5"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_3_1/conv5/bn"
  type: "BatchNorm"
  bottom: "stage_3_1/conv5"
  top: "stage_3_1/conv5"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_3_1/conv5/bn/scale"
  type: "Scale"
  bottom: "stage_3_1/conv5"
  top: "stage_3_1/conv5"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_3_1/conv5/relu"
  type: "ReLU"
  bottom: "stage_3_1/conv5"
  top: "stage_3_1/conv5"
}
layer {
  name: "stage_3_1/conv1"
  type: "Convolution"
  bottom: "stage_2_4/concat"
  top: "stage_3_1/conv1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_3_1/conv1/bn"
  type: "BatchNorm"
  bottom: "stage_3_1/conv1"
  top: "stage_3_1/conv1"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_3_1/conv1/bn/scale"
  type: "Scale"
  bottom: "stage_3_1/conv1"
  top: "stage_3_1/conv1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_3_1/conv1/relu"
  type: "ReLU"
  bottom: "stage_3_1/conv1"
  top: "stage_3_1/conv1"
}
layer {
  name: "stage_3_1/conv2"
  type: "Convolution"
  bottom: "stage_3_1/conv1"
  top: "stage_3_1/conv2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 48
    stride: 2
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_3_1/conv2/bn"
  type: "BatchNorm"
  bottom: "stage_3_1/conv2"
  top: "stage_3_1/conv2"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_3_1/conv2/bn/scale"
  type: "Scale"
  bottom: "stage_3_1/conv2"
  top: "stage_3_1/conv2"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_3_1/conv3"
  type: "Convolution"
  bottom: "stage_3_1/conv2"
  top: "stage_3_1/conv3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_3_1/conv3/bn"
  type: "BatchNorm"
  bottom: "stage_3_1/conv3"
  top: "stage_3_1/conv3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_3_1/conv3/bn/scale"
  type: "Scale"
  bottom: "stage_3_1/conv3"
  top: "stage_3_1/conv3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_3_1/conv3/relu"
  type: "ReLU"
  bottom: "stage_3_1/conv3"
  top: "stage_3_1/conv3"
}
layer {
  name: "stage_3_1/concat"
  type: "Concat"
  bottom: "stage_3_1/conv5"
  bottom: "stage_3_1/conv3"
  top: "stage_3_1/concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "stage_3_2/conv1"
  type: "Convolution"
  bottom: "stage_3_1/concat"
  top: "stage_3_2/conv1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_3_2/conv1/bn"
  type: "BatchNorm"
  bottom: "stage_3_2/conv1"
  top: "stage_3_2/conv1"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_3_2/conv1/bn/scale"
  type: "Scale"
  bottom: "stage_3_2/conv1"
  top: "stage_3_2/conv1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_3_2/conv1/relu"
  type: "ReLU"
  bottom: "stage_3_2/conv1"
  top: "stage_3_2/conv1"
}
layer {
  name: "stage_3_2/conv2"
  type: "Convolution"
  bottom: "stage_3_2/conv1"
  top: "stage_3_2/conv2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 48
    stride: 1
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_3_2/conv2/bn"
  type: "BatchNorm"
  bottom: "stage_3_2/conv2"
  top: "stage_3_2/conv2"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_3_2/conv2/bn/scale"
  type: "Scale"
  bottom: "stage_3_2/conv2"
  top: "stage_3_2/conv2"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_3_2/conv3"
  type: "Convolution"
  bottom: "stage_3_2/conv2"
  top: "stage_3_2/conv3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_3_2/conv3/bn"
  type: "BatchNorm"
  bottom: "stage_3_2/conv3"
  top: "stage_3_2/conv3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_3_2/conv3/bn/scale"
  type: "Scale"
  bottom: "stage_3_2/conv3"
  top: "stage_3_2/conv3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_3_2/conv3/relu"
  type: "ReLU"
  bottom: "stage_3_2/conv3"
  top: "stage_3_2/conv3"
}
layer {
  name: "stage_3_2/concat"
  type: "Concat"
  bottom: "stage_3_1/concat"
  bottom: "stage_3_2/conv3"
  top: "stage_3_2/concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "stage_3_3/conv1"
  type: "Convolution"
  bottom: "stage_3_2/concat"
  top: "stage_3_3/conv1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_3_3/conv1/bn"
  type: "BatchNorm"
  bottom: "stage_3_3/conv1"
  top: "stage_3_3/conv1"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_3_3/conv1/bn/scale"
  type: "Scale"
  bottom: "stage_3_3/conv1"
  top: "stage_3_3/conv1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_3_3/conv1/relu"
  type: "ReLU"
  bottom: "stage_3_3/conv1"
  top: "stage_3_3/conv1"
}
layer {
  name: "stage_3_3/conv2"
  type: "Convolution"
  bottom: "stage_3_3/conv1"
  top: "stage_3_3/conv2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 48
    stride: 1
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_3_3/conv2/bn"
  type: "BatchNorm"
  bottom: "stage_3_3/conv2"
  top: "stage_3_3/conv2"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_3_3/conv2/bn/scale"
  type: "Scale"
  bottom: "stage_3_3/conv2"
  top: "stage_3_3/conv2"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_3_3/conv3"
  type: "Convolution"
  bottom: "stage_3_3/conv2"
  top: "stage_3_3/conv3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_3_3/conv3/bn"
  type: "BatchNorm"
  bottom: "stage_3_3/conv3"
  top: "stage_3_3/conv3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_3_3/conv3/bn/scale"
  type: "Scale"
  bottom: "stage_3_3/conv3"
  top: "stage_3_3/conv3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_3_3/conv3/relu"
  type: "ReLU"
  bottom: "stage_3_3/conv3"
  top: "stage_3_3/conv3"
}
layer {
  name: "stage_3_3/concat"
  type: "Concat"
  bottom: "stage_3_2/concat"
  bottom: "stage_3_3/conv3"
  top: "stage_3_3/concat"
  concat_param {
    axis: 1
  }
}

layer {
  name: "stage_3_4/conv1"
  type: "Convolution"
  bottom: "stage_3_3/concat"
  top: "stage_3_4/conv1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_3_4/conv1/bn"
  type: "BatchNorm"
  bottom: "stage_3_4/conv1"
  top: "stage_3_4/conv1"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_3_4/conv1/bn/scale"
  type: "Scale"
  bottom: "stage_3_4/conv1"
  top: "stage_3_4/conv1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_3_4/conv1/relu"
  type: "ReLU"
  bottom: "stage_3_4/conv1"
  top: "stage_3_4/conv1"
}
layer {
  name: "stage_3_4/conv2"
  type: "Convolution"
  bottom: "stage_3_4/conv1"
  top: "stage_3_4/conv2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 48
    stride: 1
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_3_4/conv2/bn"
  type: "BatchNorm"
  bottom: "stage_3_4/conv2"
  top: "stage_3_4/conv2"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_3_4/conv2/bn/scale"
  type: "Scale"
  bottom: "stage_3_4/conv2"
  top: "stage_3_4/conv2"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_3_4/conv3"
  type: "Convolution"
  bottom: "stage_3_4/conv2"
  top: "stage_3_4/conv3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_3_4/conv3/bn"
  type: "BatchNorm"
  bottom: "stage_3_4/conv3"
  top: "stage_3_4/conv3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_3_4/conv3/bn/scale"
  type: "Scale"
  bottom: "stage_3_4/conv3"
  top: "stage_3_4/conv3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_3_4/conv3/relu"
  type: "ReLU"
  bottom: "stage_3_4/conv3"
  top: "stage_3_4/conv3"
}
layer {
  name: "stage_3_4/concat"
  type: "Concat"
  bottom: "stage_3_3/concat"
  bottom: "stage_3_4/conv3"
  top: "stage_3_4/concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "stage_3_5/conv1"
  type: "Convolution"
  bottom: "stage_3_4/concat"
  top: "stage_3_5/conv1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_3_5/conv1/bn"
  type: "BatchNorm"
  bottom: "stage_3_5/conv1"
  top: "stage_3_5/conv1"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_3_5/conv1/bn/scale"
  type: "Scale"
  bottom: "stage_3_5/conv1"
  top: "stage_3_5/conv1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_3_5/conv1/relu"
  type: "ReLU"
  bottom: "stage_3_5/conv1"
  top: "stage_3_5/conv1"
}
layer {
  name: "stage_3_5/conv2"
  type: "Convolution"
  bottom: "stage_3_5/conv1"
  top: "stage_3_5/conv2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 48
    stride: 1
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_3_5/conv2/bn"
  type: "BatchNorm"
  bottom: "stage_3_5/conv2"
  top: "stage_3_5/conv2"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_3_5/conv2/bn/scale"
  type: "Scale"
  bottom: "stage_3_5/conv2"
  top: "stage_3_5/conv2"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_3_5/conv3"
  type: "Convolution"
  bottom: "stage_3_5/conv2"
  top: "stage_3_5/conv3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_3_5/conv3/bn"
  type: "BatchNorm"
  bottom: "stage_3_5/conv3"
  top: "stage_3_5/conv3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_3_5/conv3/bn/scale"
  type: "Scale"
  bottom: "stage_3_5/conv3"
  top: "stage_3_5/conv3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_3_5/conv3/relu"
  type: "ReLU"
  bottom: "stage_3_5/conv3"
  top: "stage_3_5/conv3"
}
layer {
  name: "stage_3_5/concat"
  type: "Concat"
  bottom: "stage_3_4/concat"
  bottom: "stage_3_5/conv3"
  top: "stage_3_5/concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "stage_3_6/conv1"
  type: "Convolution"
  bottom: "stage_3_5/concat"
  top: "stage_3_6/conv1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_3_6/conv1/bn"
  type: "BatchNorm"
  bottom: "stage_3_6/conv1"
  top: "stage_3_6/conv1"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_3_6/conv1/bn/scale"
  type: "Scale"
  bottom: "stage_3_6/conv1"
  top: "stage_3_6/conv1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_3_6/conv1/relu"
  type: "ReLU"
  bottom: "stage_3_6/conv1"
  top: "stage_3_6/conv1"
}
layer {
  name: "stage_3_6/conv2"
  type: "Convolution"
  bottom: "stage_3_6/conv1"
  top: "stage_3_6/conv2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 48
    stride: 1
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_3_6/conv2/bn"
  type: "BatchNorm"
  bottom: "stage_3_6/conv2"
  top: "stage_3_6/conv2"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_3_6/conv2/bn/scale"
  type: "Scale"
  bottom: "stage_3_6/conv2"
  top: "stage_3_6/conv2"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_3_6/conv3"
  type: "Convolution"
  bottom: "stage_3_6/conv2"
  top: "stage_3_6/conv3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_3_6/conv3/bn"
  type: "BatchNorm"
  bottom: "stage_3_6/conv3"
  top: "stage_3_6/conv3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_3_6/conv3/bn/scale"
  type: "Scale"
  bottom: "stage_3_6/conv3"
  top: "stage_3_6/conv3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_3_6/conv3/relu"
  type: "ReLU"
  bottom: "stage_3_6/conv3"
  top: "stage_3_6/conv3"
}
layer {
  name: "stage_3_6/concat"
  type: "Concat"
  bottom: "stage_3_5/concat"
  bottom: "stage_3_6/conv3"
  top: "stage_3_6/concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "stage_3_7/conv1"
  type: "Convolution"
  bottom: "stage_3_6/concat"
  top: "stage_3_7/conv1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_3_7/conv1/bn"
  type: "BatchNorm"
  bottom: "stage_3_7/conv1"
  top: "stage_3_7/conv1"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_3_7/conv1/bn/scale"
  type: "Scale"
  bottom: "stage_3_7/conv1"
  top: "stage_3_7/conv1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_3_7/conv1/relu"
  type: "ReLU"
  bottom: "stage_3_7/conv1"
  top: "stage_3_7/conv1"
}
layer {
  name: "stage_3_7/conv2"
  type: "Convolution"
  bottom: "stage_3_7/conv1"
  top: "stage_3_7/conv2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 48
    stride: 1
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_3_7/conv2/bn"
  type: "BatchNorm"
  bottom: "stage_3_7/conv2"
  top: "stage_3_7/conv2"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_3_7/conv2/bn/scale"
  type: "Scale"
  bottom: "stage_3_7/conv2"
  top: "stage_3_7/conv2"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_3_7/conv3"
  type: "Convolution"
  bottom: "stage_3_7/conv2"
  top: "stage_3_7/conv3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_3_7/conv3/bn"
  type: "BatchNorm"
  bottom: "stage_3_7/conv3"
  top: "stage_3_7/conv3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_3_7/conv3/bn/scale"
  type: "Scale"
  bottom: "stage_3_7/conv3"
  top: "stage_3_7/conv3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_3_7/conv3/relu"
  type: "ReLU"
  bottom: "stage_3_7/conv3"
  top: "stage_3_7/conv3"
}
layer {
  name: "stage_3_7/concat"
  type: "Concat"
  bottom: "stage_3_6/concat"
  bottom: "stage_3_7/conv3"
  top: "stage_3_7/concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "stage_3_8/conv1"
  type: "Convolution"
  bottom: "stage_3_7/concat"
  top: "stage_3_8/conv1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_3_8/conv1/bn"
  type: "BatchNorm"
  bottom: "stage_3_8/conv1"
  top: "stage_3_8/conv1"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_3_8/conv1/bn/scale"
  type: "Scale"
  bottom: "stage_3_8/conv1"
  top: "stage_3_8/conv1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_3_8/conv1/relu"
  type: "ReLU"
  bottom: "stage_3_8/conv1"
  top: "stage_3_8/conv1"
}
layer {
  name: "stage_3_8/conv2"
  type: "Convolution"
  bottom: "stage_3_8/conv1"
  top: "stage_3_8/conv2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 48
    stride: 1
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_3_8/conv2/bn"
  type: "BatchNorm"
  bottom: "stage_3_8/conv2"
  top: "stage_3_8/conv2"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_3_8/conv2/bn/scale"
  type: "Scale"
  bottom: "stage_3_8/conv2"
  top: "stage_3_8/conv2"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_3_8/conv3"
  type: "Convolution"
  bottom: "stage_3_8/conv2"
  top: "stage_3_8/conv3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_3_8/conv3/bn"
  type: "BatchNorm"
  bottom: "stage_3_8/conv3"
  top: "stage_3_8/conv3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_3_8/conv3/bn/scale"
  type: "Scale"
  bottom: "stage_3_8/conv3"
  top: "stage_3_8/conv3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "stage_3_8/conv3/relu"
  type: "ReLU"
  bottom: "stage_3_8/conv3"
  top: "stage_3_8/conv3"
}
layer {
  name: "stage_3_8/concat"
  type: "Concat"
  bottom: "stage_3_7/concat"
  bottom: "stage_3_8/conv3"
  top: "stage_3_8/concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "stage_4_1/conv4"
  type: "Convolution"
  bottom: "stage_3_8/concat"
  top: "stage_4_1/conv4"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 16
    stride: 2
    weight_filler {
      type: "msra"
    }
    dilation: 1
  }
}
layer {
  name: "stage_4_1/conv4/bn"
  type: "BatchNorm"
  bottom: "stage_4_1/conv4"
  top: "stage_4_1/conv4"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
}
layer {
  name: "stage_4_1/conv4/bn/scale"
  type: "Scale"
  bottom: "stage_4_1/conv4"
  top: "stage_4_1/conv4"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
